Revit 2024 API
FabricationPart.ValidationStatus Property
 The validation status of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public ValidationStatus ValidationStatus { get; }
Visual Basic
Public ReadOnly Property ValidationStatus As ValidationStatus
	Get
Visual C++
public:
property ValidationStatus ValidationStatus {
	ValidationStatus get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace